# Pemilihan kolom (columns selection) pada Pandas Data Frame berdasarkan tipe data

# Import Modules

In [21]:
import pandas as pd
import numpy as np 

pd.__version__

'2.1.4'

# Persiapan Data Frame

In [22]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0         15.0         15
1         13.0          2
2          7.0         15
3         19.0         18
4         10.0          5

In [23]:
# df.index = pd.util.testing.makeDateINdex(n_rows, freq='H')
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['text'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat text
0 2023-10-01 00:00:00         15.0         15    A
1 2023-10-01 01:00:00         13.0          2    B
2 2023-10-01 02:00:00          7.0         15    C
3 2023-10-01 03:00:00         19.0         18    D
4 2023-10-01 04:00:00         10.0          5    E

# Memilih Kolom bertipe data numerik

In [24]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         15.0         15
1         13.0          2
2          7.0         15
3         19.0         18
4         10.0          5

In [28]:
df.select_dtypes(include='float')

   bil_pecahan
0         15.0
1         13.0
2          7.0
3         19.0
4         10.0

In [15]:
df.select_dtypes(include='int')

   bil_bulat
0         16
1         17
2          8
3         16
4          1

# Memilih kolom bertipe data string atau object

In [31]:
df.select_dtypes(include='object')

  text
0    A
1    B
2    C
3    D
4    E

# Memilih Kolom Bertipe Data datetime

In [32]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

# Memilih kolom dengan kombinasi tipe data

In [33]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat text
0         15.0         15    A
1         13.0          2    B
2          7.0         15    C
3         19.0         18    D
4         10.0          5    E